"""
layout.py

Все настройки внешнего вида меню.

Если нужно изменить размеры, цвета или расположение
элементов — меняется только этот файл.
"""

# ============================================================
# Размер изображения
# ============================================================

IMAGE_WIDTH = 1080
IMAGE_HEIGHT = 1920

#Высота даты

DATE_Y = 60

# ============================================================
# Цвета
# ============================================================

BACKGROUND_COLOR = "#FFFFFF"

TEXT_COLOR = "#222222"

DESCRIPTION_COLOR = "#555555"

# ============================================================
# Размеры шрифтов
# ============================================================

DATE_FONT_SIZE = 56

SECTION_FONT_SIZE = 36

ITEM_FONT_SIZE = 32

DESCRIPTION_FONT_SIZE = 24

# ============================================================
# Отступы
# ============================================================

LINE_HEIGHT = 40

ITEM_SPACING = 12

SECTION_SPACING = 40


# ============================================================
# Левая колонка
# ============================================================

LEFT_COLUMN_X = 60
LEFT_COLUMN_Y = 160

# ============================================================
# Правая колонка
# ============================================================

RIGHT_COLUMN_X = 580
RIGHT_COLUMN_Y = 160

# ============================================================
# Ширина колонок
# ============================================================

COLUMN_WIDTH = 435

COLUMN_GAP = 80
